---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileWriteOptions.#ctor
source: html/15964372-1ad1-3b1c-d96d-ab6f3dfb2579.htm
---
# Autodesk.Revit.DB.IFC.IFCFileWriteOptions.#ctor Method

Creates a default IFCFileWriteOptions. The default file format is ifc.

## Syntax (C#)
```csharp
public IFCFileWriteOptions()
```